-- 테이블 복제


-- 인덱스 생성


-- 인덱스 조회


-- 인덱스 삭제




-- 그룹별 집계


-- 그룹별 집계 뷰(가상 테이블)의 생성


-- 그룹별 집계 뷰의 조회


-- 그룹별 집계 뷰의 삭제


-- 테이블 복제


-- 테이블 구조 변경
-- 기본키 추가

-- 정렬 검색


-- 외래키 추가




delete from tbl_course_2303 where c_no='20005';

-- 서브쿼리
-- 일치 검색

-- 수강생이 있는 과정 코스(tbl_course_2303)를 조회

-- 배정된 교사 정보(tbl_teacher_2303) 조회

-- 교사(tbl_teacher_2303)가 강의하고 있는 강의 정보(tbl_course_2303)를 조회

-- 수강생이 있어 개강예정인 교사 정보를 출력


-- 불일치 검색



-- 수강생이 없는 과정 코스(tbl_course_2303)

-- 배정되지 않은 교사 정보(tbl_teacher_2303) 조회

-- 교사(tbl_teacher_2303)가 강의하고 않은 강의 정보(tbl_course_2303)를 조회

-- 수강생이 없어 휴강예정인 교사 정보를 출력



-- 내부 조인
-- 강의별 과정이름, 교사명, 강의실 검색 


-- 수강생이 있는 과정 코스(tbl_course_2303)를 조회

-- 배정된 교사 정보(tbl_teacher_2303) 조회

-- 교사(tbl_teacher_2303)가 강의하고 있는 강의 정보(tbl_course_2303)를 조회











